[
  {
    "name": "Prof. Elvis Asare-Bediako",
    "Position & Affiliation": "Vice-Chancellor, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Accomplished scholar with expertise in energy and natural resources management.",
    "Career / Work Experience / Research Interests": "Provides overall leadership and administration of UENR, with a focus on strategic direction, international collaboration, and research advancement in energy and natural resources.",
    "current_position": "Vice-Chancellor",
    "role": "Chief executive officer of UENR, responsible for the overall administration and strategic direction of the university.",
    "achievements": [
      "Led initiatives to enhance research and development in the energy sectors.",
      "Strengthened international collaborations with academic and research institutions."
    ]
  },
  {
    "name": "Prof. John K. M. Kuwornu",
    "Position & Affiliation": "Acting Pro Vice-Chancellor, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Seasoned academic with a background in higher education management.",
    "Career / Work Experience / Research Interests": "Assists the Vice-Chancellor in academic and administrative duties, with a focus on academic affairs, student services, and strengthening academic standards.",
    "current_position": "Ag. Pro Vice-Chancellor",
    "role": "Assists the Vice-Chancellor in academic and administrative duties, focusing on academic affairs and student services.",
    "achievements": [
      "Implemented policies to improve academic standards and student support services.",
      "Fostered partnerships with industry stakeholders to enhance curriculum relevance."
    ]
  },
  {
    "name": "Prof. Peter Appiahene",
    "Position & Affiliation": "Head of Department, Information Technology and Decision Sciences (ITDS), School of Sciences, UENR.",
    "Education & Qualifications": "PhD in Computer Science, MSc in Computer Science, BSc in Information Technology.",
    "Career / Work Experience / Research Interests": "Associate Professor and researcher in Information Technology and Decision Sciences. He has extensive teaching and research experience in computer science, data science, decision systems, and IT-related fields. Currently serves as the Head of the ITDS Department, overseeing academic and administrative activities of the unit.",
    "current_position": "Head of Department, ITDS",
    "role": "Provides academic and administrative leadership to the Department of Information Technology and Decision Sciences (ITDS), focusing on curriculum development, staff supervision, and fostering research and industry collaboration.",
    "achievements": [
      "Appointed as Head of the Department of ITDS at UENR.",
      "Supervised numerous undergraduate and postgraduate research projects in IT and decision sciences.",
      "Published multiple research papers in information technology, decision systems, and applied computing.",
      "Contributed to advancing the ITDS department’s academic programs and industry partnerships."
  ]
  },
  {
    "name": "Prof. Dominic Otoo",
    "Position & Affiliation": "Dean of Students, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Academic and student affairs expert committed to student development.",
    "Career / Work Experience / Research Interests": "Oversees student welfare, discipline, and extracurricular activities to promote a supportive learning environment and student leadership.",
    "current_position": "Dean of Students",
    "role": "Oversees student welfare, discipline, and extracurricular activities, ensuring a conducive environment for student development.",
    "achievements": [
      "Established programs to promote student engagement and leadership.",
      "Developed initiatives to address student welfare and concerns."
    ]
  },
  {
    "name": "Prof. Simon Abugre",
    "Position & Affiliation": "Dean of Students, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Dedicated academic leader in student affairs.",
    "Career / Work Experience / Research Interests": "Leads the Office of the Dean of Students, focusing on student welfare, engagement, and creating a vibrant campus life.",
    "current_position": "Dean of Students",
    "role": "Leads the Office of the Dean of Students, focusing on student affairs and campus life.",
    "achievements": [
      "Chaired meetings to discuss student issues and welfare.",
      "Organized events to enhance student involvement and campus culture."
    ]
  },
  {
    "name": "Dr. Michael Opoku",
    "Position & Affiliation": "Lecturer, Department of Computer Science and Informatics, School of Sciences, UENR.",
    "Education & Qualifications": "PhD in Computer Science (UENR), MSc in Information Technology (KNUST), BSc in Computer Science (Catholic University College of Ghana), Diploma in Mechanical Engineering, CCNA, Microsoft Certified Educator, Mediation & Arbitration training.",
    "Career / Work Experience / Research Interests": "Lecturer and researcher in Data Science, Artificial Intelligence, networking, and computer security. Previously served as Head of ICT Department at the Catholic University College of Ghana.",
    "current_position": "Lecturer",
    "role": "Lectures and conducts research in data science, AI, networking, and computer security, while mentoring students in academic and professional development.",
    "achievements": [
      "Published several research papers in reputable journals.",
      "Serves as a reviewer for academic journals in computer science and IT.",
      "Contributed to ICT infrastructure development at the Catholic University College of Ghana."
    ]
  },
  {
    "name": "Abdulah Adjei Zakaria",
    "Position & Affiliation": "SRC President, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Student leader with strong advocacy and leadership skills.",
    "Career / Work Experience / Research Interests": "Represents the student body in university governance, advocates for student rights, and spearheads initiatives for campus development.",
    "current_position": "SRC President",
    "role": "Serves as the chief spokesperson for the student body, representing student interests to the university administration.",
    "achievements": [
      "Elected as the SRC President for the 2025/2026 academic year.",
      "Initiated projects aimed at enhancing student life and campus infrastructure."
    ]
  },
  {
    "name": "Cassandra Boachie",
    "Position & Affiliation": "SRC Vice President, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Student leader passionate about engagement and academic support.",
    "Career / Work Experience / Research Interests": "Supports the SRC President in executing leadership duties, promotes student engagement, and advocates for academic excellence.",
    "current_position": "SRC Vice President",
    "role": "Assists the SRC President in leadership duties and supports various student initiatives.",
    "achievements": [
      "Collaborated on projects to improve student services and academic support.",
      "Represented student interests in university committees and forums."
    ]
  },
  {
    "name": "Bernard Owusu",
    "Position & Affiliation": "SRC General Secretary, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "Student leader with strong communication and organizational skills.",
    "Career / Work Experience / Research Interests": "Manages SRC communications, ensures documentation integrity, and strengthens transparency between students and the administration.",
    "current_position": "SRC General Secretary",
    "role": "Manages SRC communications and documentation, ensuring effective information flow within the student body.",
    "achievements": [
      "Enhanced communication channels within the SRC and with the student body.",
      "Organized events to disseminate information on student rights and opportunities."
    ]
  },
  {
    "name": "Mr. Robert Cudjoe",
    "Position & Affiliation": "Director, IT Directorate, University of Energy and Natural Resources (UENR).",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Leads the IT Directorate, overseeing the provision of all I.T. related services in the university including network infrastructure, software development, systems, e-learning, and data security. Heads a unit of about eighteen technical staff.",
    "current_position": "Director, IT Directorate",
    "role": "Responsible for overall management of the IT Directorate; ensuring development and deployment of business applications; safeguarding data security; management of infrastructure and e-learning systems.",
    "achievements": [
      "Overseeing development and deployment of most of the University’s business applications.",
      "Maintained data security on the University network."
    ]
  },
  {
    "name": "Dr. Gilbert Mensah",
    "Position & Affiliation": "Senior Software Engineer, IT Directorate, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Responsible for software engineering tasks in UENR’s IT Directorate; involved in designing and developing internal applications and tools.",
    "current_position": "Senior Software Engineer",
    "role": "Develops and maintains software applications, supports software services, contributes to technological solutions for university systems.",
    "achievements": [
      "Serves as Senior Software Engineer in the Directorate."
    ]
  },
  {
    "name": "Kobia Williams",
    "Position & Affiliation": "Network Systems Administrator, IT Directorate, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Manages network systems and infrastructure in UENR; ensures reliable connectivity, system stability, and network security across campus.",
    "current_position": "Network Systems Administrator",
    "role": "Administers network operations, ensures systems are up and secure, supports network-based services.",
    "achievements": [
      "Appointed to the network systems administrator role in the IT Directorate."
    ]
  },
  {
    "name": "Emmanuel Asante",
    "Position & Affiliation": "Senior ICT Assistant (Software Developer), IT Directorate, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Works in the software development division of the IT Directorate; contributes to developing software solutions for campus needs.",
    "current_position": "Senior ICT Assistant (Software Developer)",
    "role": "Participates in design, implementation and maintenance of software; works under the software development division.",
    "achievements": [
      "Serving as Senior ICT Assistant in software development."
    ]
  },
  {
    "name": "Emmanuel Acquah",
    "Position & Affiliation": "Senior ICT Assistant (Software Developer), IT Directorate, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Collaborates on software projects, assists in maintaining and building IT applications for the University.",
    "current_position": "Senior ICT Assistant (Software Developer)",
    "role": "Engages in software development, maintenance, and support within the IT Directorate.",
    "achievements": [
      "Part of the software developer team in the Directorate."
    ]
  },
  {
    "name": "Dr. Owusu Nyarko-Boateng",
    "Position & Affiliation": "Lecturer, Department of Computer Science and Informatics, School of Sciences, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Teaches and conducts research in computer science; part of the faculty in the Department of Computer Science and Informatics.",
    "current_position": "Lecturer",
    "role": "Academic staff dealing with teaching, research, mentoring students in computer science.",
    "achievements": [
      "Member of the teaching staff in the Department of Computer Science and Informatics."
    ]
  },
  {
    "name": "Obed Appiah",
    "Position & Affiliation": "Senior Lecturer, Department of Computer Science and Informatics, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Engaged in higher-level teaching, supervision of students, and research in computing.",
    "current_position": "Senior Lecturer",
    "role": "Leads courses, advises students, conducts research, and contributes to departmental leadership.",
    "achievements": [
      "Holds senior lecturer status in the Department of Computer Science and Informatics."
    ]
  },
  {
    "name": "Dr. Peter Nimbe",
    "Position & Affiliation": "Senior Lecturer, Department of Computer Science and Informatics, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Senior teaching staff member in Computer Science & Informatics, instructs undergraduate/graduate courses, involved in research.",
    "current_position": "Senior Lecturer",
    "role": "Senior academic role in teaching, supervision and research in the department.",
    "achievements": [
      "Senior Lecturer in the Department of Computer Science and Informatics."
    ]
  },
  {
    "name": "Dr. Isaac Kofi Nti",
    "Position & Affiliation": "Lecturer, Department of Computer Science and Informatics, UENR.",
    "Education & Qualifications": "unknown",
    "Career / Work Experience / Research Interests": "Teaches computer science courses, supervises student projects, and conducts research.",
    "current_position": "Lecturer",
    "role": "Academic teaching and research in Computer Science and Informatics.",
    "achievements": [
      "Member of teaching staff in the Department of Computer Science and Informatics."
    ]
  }
]
